#region << 版 本 注 释 >>
/*----------------------------------------------------------------
* 项目名称 ：CP02Types
* 项目描述 ：关于数据类型的例程
* 类 名 称 ：Program
* 类 描 述 ：
* 所在的域 ：LAPTOP-O6ENK577
* 命名空间 ：CP02Types
* 机器名称 ：LAPTOP-O6ENK577 
* CLR 版本 ：4.0.30319.42000
* 作    者 ：Elvinsys
* 创建时间 ：2020-02-03 16:09:18
* 更新时间 ：2020-02-03 16:09:18
* 版 本 号 ：v1.0.0.0
*******************************************************************
* Copyright @ Elvinsys 2020. All rights reserved.
*******************************************************************
//----------------------------------------------------------------*/
#endregion

using System;

namespace CP02Types
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
             *  例程编号：CS002
             *  描述：
             *      输出常量（字符串、字符、整数、小数、金钱、布尔、二进制、八进制、十六进制）
             *      说明：
             */
            //例程：


        }
    }
}
