#region << 版 本 注 释 >>
/*----------------------------------------------------------------
 * 项目名称 ：CP05Loop
 * 项目描述 ：循环结构的练习文档
 * 类 名 称 ：Program
 * 类 描 述 ：循环的练习文档
 * 命名空间 ：CP05Loop
 * 机器名称 ：DESKTOP-UPPQS8L
 * CLR 版本 ：4.0.30319.42000
 * 作    者 ：Elvinsys
 * 创建时间 ：2020-03-09 19:28:00
 * 更新时间 ：2020-03-09 19:28:00
 * 版 本 号 ：v1.0.0.0
 ****************************************************************
 * Copyright @ Elvinsys 2020. All rights reserved.
 ****************************************************************
----------------------------------------------------------------*/
#endregion

/*
 *  循环结构结构：
 *      for...
 *      foreach...
 *      while...
 *      do...while...
 */

using System;
using CP00Forms;

namespace CP05Loop
{
    class Program
    {
        static void Main(string[] args)
        {
            #region CP05_01：用for语句输出十次Hello World
            /*
             *  例程编号：CP05_01
             *  摘要：
             *      用for语句输出十次Hello World
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_01");
            //Lop01For.CP05_01();

            #region CP05_02：用while语句输出十次Hello World
            /*
             *  例程编号：CP05_02
             *  摘要：
             *      用while语句输出十次Hello World
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_02");
            //Lop02While.CP05_02();

            #region CP05_03：用for语句输出1-10
            /*
             *  例程编号：CP05_03
             *  摘要：
             *      用for语句输出1-10
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_03");
            //Lop01For.CP05_03();

            #region CP05_04：用while语句输出1-10
            /*
             *  例程编号：CP05_04
             *  摘要：
             *      用while语句输出1-10
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_04");
            //Lop02While.CP05_04();

            #region CP05_05：用for语句输出10-1
            /*
             *  例程编号：CP05_05
             *  摘要：
             *      用for语句输出10-1
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_05");
            //Lop01For.CP05_05();

            #region CP05_06：用while语句输出10-1
            /*
             *  例程编号：CP05_06
             *  摘要：
             *      用while语句输出10-1
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP_05_06");
            //Lop02While.CP05_06();

            #region CP05_07：用for语句计算出1-10相加的和
            /*
             *  例程编号：CP05_07
             *  摘要：
             *      用for语句计算出1-10相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_07");
            //Lop01For.CP05_07();

            #region CP05_08：用while语句计算出1-10相加的和
            /*
             *  例程编号：CP05_08
             *  摘要：
             *      用while语句计算出1-10相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_08");
            //Lop02While.CP05_08();

            #region CP05_09：用for语句计算出1-100相加的和
            /*
             *  例程编号：CP05_09
             *  摘要：
             *      用for语句计算出1-100相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int          sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_09");
            //Lop01For.CP05_09();

            #region CP05_10：用while语句计算出1-100相加的和
            /*
             *  例程编号：CP05_10
             *  摘要：
             *      用while语句计算出1-100相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_10");
            //Lop02While.CP05_10();

            #region CP05_11：用for语句计算出1-100的偶数和
            /*
             *  例程编号：CP05_11
             *  摘要：
             *      用for语句计算出1-100的偶数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_11");
            //Lop01For.CP05_11();

            #region CP05_12：用while语句计算出1-100的偶数和
            /*
             *  例程编号：CP05_12
             *  摘要：
             *      用while语句计算出1-100的偶数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_12");
            //Lop02While.CP05_12();

            #region CP05_13：用for语句计算出1-100的奇数和
            /*
             *  例程编号：CP05_13
             *  摘要：
             *      用for语句计算出1-100的奇数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_13");
            //Lop01For.CP05_13();

            #region CP05_14：用while语句计算出1-100的奇数和
            /*
             *  例程编号：CP05_14
             *  摘要：
             *      用while语句计算出1-100的奇数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_14");
            //Lop02While.CP05_14();

            #region CP05_15：用for语句求5的阶乘
            /*
             *  例程编号：CP05_15
             *  摘要：
             *      用for语句求5的阶乘
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         iFactorial
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_15");
            //Lop01For.CP05_15();

            #region CP05_16：用while语句求5的阶乘
            /*
             *  例程编号：CP05_16
             *  摘要：
             *      用while语句求5的阶乘
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         iFactorial
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_16");
            //Lop02While.CP05_16();

            #region CP05_17：用for语句打印九九乘法表
            /*
             *  例程编号：CP05_17
             *  摘要：
             *      用for语句打印九九乘法表
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_17");
            //Lop01For.CP05_17();

            #region CP05_18：用for语句，在1——1000中满足条件的数，并输出到控制台
            /*
             *  例程编号：CP05_18
             *  摘要：
             *      用for语句，在1——1000中满足条件的数，并输出到控制台
             *  说明：
             *      1）x % 3 = 2
             *      2）x % 5 = 3
             *      3）x % 7 = 2
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_18");
            //Lop01For.CP05_18();

            #region CP05_19：用while语句，在1——1000中满足条件的数，并输出到控制台
            /*
             *  例程编号：CP05_19
             *  摘要：
             *      用while语句，在1——1000中满足条件的数，并输出到控制台
             *  说明：
             *      1）x % 3 = 2
             *      2）x % 5 = 3
             *      3）x % 7 = 2
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_19");
            //Lop02While.CP05_19();

            #region CP05_20：while语句和do while语句的区别
            /*
             *  例程编号：CP01_01
             *  摘要：
             *      while语句和do while语句的区别
             *  说明：
             *      1）while语句，先对条件进行判断，再执行语句体
             *      2）do while语句，先执行语句体，再对条件进行判断
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_20");
            //Lop02While.CP05_20();

            #region CP05_21：用户名密码检验程序
            /*
             *  例程编号：CP05_21
             *  摘要：
             *      用户名密码检验程序
             *  说明：
             *      1）用到循环结构，输入错误三次就退出
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_21");
            //Lop02While.CP05_21();

            #region CP05_22：打印用户输入的整形数据的两倍，按q结束程序
            /*
             *  例程编号：CP05_22
             *  摘要：
             *      打印用户输入的数字的两倍，按q结束程序
             *  说明：
             *      1）用while语句进行循环输入输出
             *      2）利用异常捕获检测用户输入的非整形数据
             *      3）利用if...else...语句判断是否按q
             *      4）用户输入的是字符串，因此要对数据进行转换
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  string      strInteger
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_22");
            //Lop02While.CP05_22();

            #region CP05_23：输入三个人的成绩，并计算平均成绩
            /*
             *  例程编号：CP05_23
             *  摘要：
             *      输入三个人的成绩，并计算平均成绩
             *  说明：
             *      1）成绩必须是1-100的整数
             *      2）用while语句录入成绩并计算平均值
             *      3）try...catch...检测录入的数据是否正常
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         iScore
             *                  int         i
             *                  bool        bFlag
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_23");
            //Lop02While.CP05_23();

            #region CP05_24：用while语句和continue计算题
            /*
             *  例程编号：CP05_24
             *  摘要：
             *      用while语句和continue计算题
             *  说明：
             *      1）计算1-100中，除了能被7整除的数以外的其他数之和
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_24");
            //Lop02While.CP05_24();

            #region CP05_25：用for语句和continue计算题
            /*
             *  例程编号：CP05_25
             *  摘要：
             *      计算1-100中，除了能被7整除的数以外的其他数之和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_25");
            //Lop01For.CP05_25();

            #region CP05_26：用for语句找出1-100中的所有素数
            /*
             *  例程编号：CP05_26
             *  摘要：
             *      用for语句找出1-100中的所有素数
             *  说明：
             *      1）素数：只能被1和自己整除的整数
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  bool        bFlag
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_26");
            //Lop01For.CP05_26();

            #region CP05_27：foreach的简单例程
            /*
             *  例程编号：CP05_27
             *  摘要：
             *      foreach的简单例程
             *  说明：
             *      1）定义一个整形一维数组，里面放1-5
             *      2）用foreach打印到控制台
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_27");
            //Lop03Foreach.CP05_27();
        }
    }
}
