#region << 版 本 注 释 >>
/*----------------------------------------------------------------
 * 项目名称 ：CP05Loop
 * 项目描述 ：循环结构的练习文档
 * 类 名 称 ：Program
 * 类 描 述 ：循环的练习文档
 * 命名空间 ：CP05Loop
 * 机器名称 ：DESKTOP-UPPQS8L
 * CLR 版本 ：4.0.30319.42000
 * 作    者 ：Elvinsys
 * 创建时间 ：2020-03-09 19:28:00
 * 更新时间 ：2020-03-09 19:28:00
 * 版 本 号 ：v1.0.0.0
 ****************************************************************
 * Copyright @ Elvinsys 2020. All rights reserved.
 ****************************************************************
----------------------------------------------------------------*/
#endregion

/*
 *  循环结构结构：
 *      for...
 *      foreach...
 *      while...
 *      do...while...
 */

using System;
using CP00Forms;

namespace CP05Loop
{
    class Program
    {
        static void Main(string[] args)
        {
            #region CP05_01：用for语句输出十次Hello World
            /*
             *  例程编号：CP05_01
             *  摘要：
             *      用for语句输出十次Hello World
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_01");
            //Lop01For.CP05_01();

            #region CP05_02：用while语句输出十次Hello World
            /*
             *  例程编号：CP05_02
             *  摘要：
             *      用while语句输出十次Hello World
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_02");
            //Lop02While.CP05_02();

            #region CP05_03：用for语句输出1-10
            /*
             *  例程编号：CP05_03
             *  摘要：
             *      用for语句输出1-10
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_03");
            //Lop01For.CP05_03();

            #region CP05_04：用while语句输出1-10
            /*
             *  例程编号：CP05_04
             *  摘要：
             *      用while语句输出1-10
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_04");
            //Lop02While.CP05_04();

            #region CP05_05：用for语句输出10-1
            /*
             *  例程编号：CP05_05
             *  摘要：
             *      用for语句输出10-1
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_05");
            //Lop01For.CP05_05();

            #region CP05_06：用while语句输出10-1
            /*
             *  例程编号：CP05_06
             *  摘要：
             *      用while语句输出10-1
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP_05_06");
            //Lop02While.CP05_06();

            #region CP05_07：用for语句计算出1-10相加的和
            /*
             *  例程编号：CP05_07
             *  摘要：
             *      用for语句计算出1-10相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_07");
            //Lop01For.CP05_07();

            #region CP05_08：用while语句计算出1-10相加的和
            /*
             *  例程编号：CP05_08
             *  摘要：
             *      用while语句计算出1-10相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_08");
            //Lop02While.CP05_08();

            #region CP05_09：用for语句计算出1-100相加的和
            /*
             *  例程编号：CP05_09
             *  摘要：
             *      用for语句计算出1-100相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int          sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_09");
            //Lop01For.CP05_09();

            #region CP05_10：用while语句计算出1-100相加的和
            /*
             *  例程编号：CP05_10
             *  摘要：
             *      用while语句计算出1-100相加的和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_10");
            //Lop02While.CP05_10();

            #region CP05_11：用for语句计算出1-100的偶数和
            /*
             *  例程编号：CP05_11
             *  摘要：
             *      用for语句计算出1-100的偶数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_11");
            //Lop01For.CP05_11();

            #region CP05_12：用while语句计算出1-100的偶数和
            /*
             *  例程编号：CP05_12
             *  摘要：
             *      用while语句计算出1-100的偶数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         sum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_12");
            //Lop02While.CP05_12();

            #region CP05_13：用for语句计算出1-100的奇数和
            /*
             *  例程编号：CP05_13
             *  摘要：
             *      用for语句计算出1-100的奇数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_13");
            //Lop01For.CP05_13();

            #region CP05_14：用while语句计算出1-100的奇数和
            /*
             *  例程编号：CP05_14
             *  摘要：
             *      用while语句计算出1-100的奇数和
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         iSum
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_14");
            //Lop02While.CP05_14();

            #region CP05_15：用for语句求5的阶乘
            /*
             *  例程编号：CP05_15
             *  摘要：
             *      用for语句求5的阶乘
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         iFactorial
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_15");
            //Lop01For.CP05_15();

            #region CP05_16：用while语句求5的阶乘
            /*
             *  例程编号：CP05_16
             *  摘要：
             *      用while语句求5的阶乘
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *                  int         iFactorial
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_16");
            //Lop02While.CP05_16();

            #region CP05_17：用for语句打印九九乘法表
            /*
             *  例程编号：CP05_17
             *  摘要：
             *      用for语句打印九九乘法表
             *  说明：
             *      1）
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_17");
            //Lop01For.CP05_17();

            #region CP05_18：用for语句，在1——1000中满足条件的数，并输出到控制台
            /*
             *  例程编号：CP05_18
             *  摘要：
             *      用for语句，在1——1000中满足条件的数，并输出到控制台
             *  说明：
             *      1）x % 3 = 2
             *      2）x % 5 = 3
             *      3）x % 7 = 2
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_18");
            //Lop01For.CP05_18();

            #region CP05_19：用while语句，在1——1000中满足条件的数，并输出到控制台
            /*
             *  例程编号：CP05_19
             *  摘要：
             *      用while语句，在1——1000中满足条件的数，并输出到控制台
             *  说明：
             *      1）x % 3 = 2
             *      2）x % 5 = 3
             *      3）x % 7 = 2
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_19");
            //Lop02While.CP05_19();

            #region CP05_20：while语句和do while语句的区别
            /*
             *  例程编号：CP01_01
             *  摘要：
             *      while语句和do while语句的区别
             *  说明：
             *      1）while语句，先对条件进行判断，再执行语句体
             *      2）do while语句，先执行语句体，再对条件进行判断
             *  步骤：
             *      1）
             *  变量：
             *      修饰符     变量类型      变量名       备注
             *                  int         i
             *  方法：
             *      修饰符         返回值类型    方法名            参数类型    备注
             */
            #endregion
            //Forms.Line("CP05_20");
            //Lop02While.CP05_20();


        }
    }
}
